luisfynn/sva/vrc1k/src/stm32f10x_system.c
/**
 *	@file   stm32f10x_system.c
 *	@brief	
 *	@author luisfynn <tani223@pinetron.com>
 *	@date   2014/09/24 14:01
 */

/* system include */
#include <stdio.h>
#include <string.h>
/* local include */
#include "stm32f10x_conf.h"
#include "stm32f10x_system.h"
#include "stm32f10x_it.h"
#include "video.h"
#include "mdintype.h"
#include "mdini2c.h"
#include "mdin3xx.h"
#include "mdindly.h"
#include "mdinosd.h"
#include "rx_lib.h"

NCDEC_INFO	ncDec;

//Remocon 
#define	LEADER_VAL	133				// Leader code = 13.5mSec	((FREQUENCY/12000000)*13500)/256
#define	LEADER_MAX	LEADER_VAL+1	// leader code duty maximum
#define	LEADER_MIN	LEADER_VAL-1	// leader code duty minimum

#define	BIT_HI_VAL	22				// bit high = 2.25mSec	((FREQUENCY/12000000)*2250)/256	
#define	BIT_HI_MAX	BIT_HI_VAL+1	// bit high duty maximum
#define	BIT_HI_MIN	BIT_HI_VAL-1	// bit high duty minimum

#define	BIT_LO_VAL	11				// bit low = 1.125mSec	((FREQUENCY/12000000)*1125)/256
#define	BIT_LO_MAX	BIT_LO_VAL+1	// bit low duty maximum
#define	BIT_LO_MIN	BIT_LO_VAL-1	// bit low duty maximum

WORD 	Ir_Timer_Count =0;
BYTE	chk_bit_cnt;
BYTE	data_bit_cnt;
BYTE	data_cnt;
BYTE	remocon_temp;
BYTE	remocon_data[4];
BYTE	remocon_trans_data[4];
BYTE	Repeat_IR_Key=0;
BYTE	Old_IR_Key=0;
BYTE	LEADER_OK;		// leader code check ok flag
BYTE 	IR_Buffer[20];
BYTE 	IR_Buffer_Count = 0;
BYTE 	IR_Key_Pressed = 0;
BYTE 	First_IR_Pressed = 0;

//video check 
BYTE	Video_Change_Det_A = 0;
BYTE	Video_Change_Det_B = 0;
BYTE	System_Watchdog_En = 0;

//debug 
BYTE 	message_load_ok = 0;

//USART
extern 	BYTE RxBuffer[RxBufferSize];
extern 	BYTE usart_receive_end;
extern 	WORD RxCounter;

//OSD
extern 	SPRITE_CTL_INFO stOSD[12];
extern 	LAYER_CTL_INFO stLayer[3];

//RTC
BYTE 	RTC_Year, RTC_Mon, RTC_Day, RTC_Hour, RTC_Min, RTC_Sec = 0;
WORD 	TYEAR = 2014, TMON = 12, TDAY = 31;
WORD 	THH = 0, TMM = 0, TSS = 0;
WORD 	TMM_Old;
DWORD 	RTC_Count, TimeDisplay = 0;

void System_Init(void)
{
	RCC_Configuration();		//system clock initialize

	NVIC_Configuration();		//vector table set

	GPIO_Initialize();			//GPIO initialize
				
	USART_Initialize();			//USART initialize
					
	I2C_Initialize();			//I2C initialize

	Remocon_Configuration();

	RTC_Time_Init();

	Power_Status(ON);

	Device_Reset();

	Video_Detection(&ncDec);
}

void Video_Init(PNCDEC_INFO pINFO, RX_OP_MODE OperatingMode)
{
	if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_1) == 1)
	{
		ADV7611_INIT(&ncDec,RX_OPMODE_HDMI);
	}else{
		NVP6114_CommonInit(&ncDec);
	}
	NVP6011_CommonInit(&ncDec);
	MDIN3xx_AHDSetRegInitial(&ncDec);
}

void Remocon_Configuration(void)
{
	Timer2_Init();

	IR_Receiver(); 
}

void RCC_Configuration(void)			//Reset & Clock control
{
	ErrorStatus HSEStartUpStatus;
	 
	/* Reset the RCC clock configuration to default reset state */
	RCC_DeInit();
	
	/* Configure the High Speed External oscillator */
	RCC_HSEConfig(RCC_HSE_ON);
			 
	/* Wait for HSE start-up */
	HSEStartUpStatus = RCC_WaitForHSEStartUp();
				 
	if(HSEStartUpStatus == SUCCESS)
	{
		/* Enable Prefetch Buffer */
		FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);
										 
		/* Set the code latency value: FLASH Two Latency cycles */
		FLASH_SetLatency(FLASH_Latency_2);
												 
		/* Configure the AHB clock(HCLK): HCLK = SYSCLK */
		RCC_HCLKConfig(RCC_SYSCLK_Div1);
														 
		/* Configure the High Speed APB2 clcok(PCLK2): PCLK2 = HCLK */
		RCC_PCLK2Config(RCC_HCLK_Div1);
																 
		/* Configure the Low Speed APB1 clock(PCLK1): PCLK1 = HCLK/2 */
		RCC_PCLK1Config(RCC_HCLK_Div2);
																		 
		/* Configure the PLL clock source and multiplication factor     */
		/* PLLCLK = HSE*PLLMul = 8*9 = 72MHz */
		RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9);
																				 
		/* Enable PLL   */
		RCC_PLLCmd(ENABLE);
																						 
		/* Check whether the specified RCC flag is set or not */
		/* Wait till PLL is ready       */
		while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);
																								 
		/* Select PLL as system clock source */
		RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
																								 
		/* Get System Clock Source */
		/* Wait till PLL is used as system clock source */
		while(RCC_GetSYSCLKSource() != 0x08);
	} 
}

void NVIC_Configuration(void)
{
#ifdef  VECT_TAB_RAM  
	/* Set the Vector Table base location at 0x20000000 */ 
	 NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 
#else  /* VECT_TAB_FLASH  */
	/* Set the Vector Table base location at 0x08000000 */ 
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);   
#endif
	/* Configure one bit for preemption priority */
	/*PriorityGroup_4 has 16 Group Priorities & zero SubPriority */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	
	/* Enable the USART3 Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/*TIM2 global interrupt initialize*/
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the EXTI15_10 Interrupt */
  	NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the RTC Interrupt */
  	NVIC_InitStructure.NVIC_IRQChannel = RTC_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
 	NVIC_Init(&NVIC_InitStructure);

	/* Enable the WWDG Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = WWDG_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 4;
    NVIC_Init(&NVIC_InitStructure);
}

void GPIO_Initialize(void)
{ 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB |
			               RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD |
						   RCC_APB2Periph_GPIOE, ENABLE);

