luisfynn/sva/vrc1k/src/stm32f10x_system.c
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	GPIO_Init(GPIOE, &GPIO_InitStructure);
					  
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; 
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	//ADV7611 OR NVP6114 SELECT-TBD
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB |
						   RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD |
 						   RCC_APB2Periph_GPIOE, DISABLE); 
}

void USART_Initialize(void)
{
	/*Enable GPIOx clock*/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
	   
	/* Enable USART3 clocks */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE); 
		  
	/* Configure the USART3 Software Pins remapping */
	GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE);
		   
	/* Configure USARTx_Tx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* Configure USARTx_Rx as input floating */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* USARTx configuration ------------------------------------------------------*/
	/* USARTx configured as follow:
	*         - BaudRate = 115200 baud  
	*         - Word Length = 8 Bits
	*         - One Stop Bit
	*    	  - No parity
	*         - Hardware flow control disabled (RTS and CTS signals)
	*         - Receive and transmit enabled
	* */

	USART_InitStructure.USART_BaudRate = 115200;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No ;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	/* Configure the USARTx */ 
	USART_Init(USART3, &USART_InitStructure);

	/* Enable the USARTx */
	USART_Cmd(USART3, ENABLE);

	/* Enable USART3 interrupt */
	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
	USART_ITConfig(USART3, USART_IT_TXE, ENABLE);

	printf("\rUSART3 init Complete\n");
}

void Device_Reset(void)
{
	/*Enable GPIOx clock*/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	    
	/*GPIO Pin Configuration*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_ResetBits(GPIOC,GPIO_Pin_7);
	MDINDLY_mSec(300);

	//TIM2 test funciton 
#if 0	
	BYTE i;
	for(i=0;i<10;i++){
		Timer_delay(45000);
	}
#endif
	//-------END--------

	GPIO_SetBits(GPIOC,GPIO_Pin_7);
}

void Power_Status(BYTE control)
{   
	/*Enable GPIOx clock*/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
	    
	/*GPIO Pin Configuration*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
			   
	switch(control)
	{
		case ON:
			GPIO_SetBits(GPIOD,GPIO_Pin_2); 
			break;
											     
		case OFF:
			GPIO_ResetBits(GPIOD,GPIO_Pin_2);
			break;
														      
		case RESTART:
			MDINDLY_mSec(300);	//300ms
			GPIO_ResetBits(GPIOD,GPIO_Pin_2);
			MDINDLY_mSec(300);               
			GPIO_SetBits(GPIOD,GPIO_Pin_2);
			break;
																						    
		default:
			break;
	}
}

void Video_Detection(PNCDEC_INFO pINFO)
{
	Video_Change_Det_A = GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_8);
	Video_Change_Det_B = GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_9);
	
	if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_1) ==1){		//ADV7611 INIT
		if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_8)==1) //1280X720P60
		{
			if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_9)==1){        //NTSC
				pINFO->vformat = NTSC;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
				pINFO->rx.resolution = NCRESOL_1280X720P;
			}else{  //PAL
				pINFO->vformat = PAL;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
				pINFO->rx.resolution = NCRESOL_1280X720P;
			}
		}else{											//720X480P60
			if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_9)==1){        //NTSC
				pINFO->vformat = NTSC;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
				pINFO->rx.resolution = NCRESOL_720X480;
			}else{  //PAL
				pINFO->vformat = PAL;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
				pINFO->rx.resolution = NCRESOL_720X480;
			}
		}
	}else{													//NVP6114 INIT
		if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_8)==1) //AHD
		{
			if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_9)==1){        //30Hz
				pINFO->vformat = NTSC;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
				pINFO->rx.resolution = NCRESOL_1280X720P;
			}else{  //25Hz
				pINFO->vformat = PAL;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
				pINFO->rx.resolution = NCRESOL_1280X720P;
			}
		}else    //SD 
		{
			if(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_9)==1){//NTSC
				pINFO->rx.resolution = NCRESOL_960X480;
				pINFO->vformat = NTSC;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
			}else{ //PAL
				pINFO->rx.resolution = NCRESOL_960X576;
				pINFO->vformat = PAL;
				pINFO->tx.enc_inputclk = ENC_CLK_74M;
				pINFO->tx.enc_input_bus = ENC_INBUS_16B;
			}													
		}
	}
}

void Timer2_Init(void)
{
	//TIM2 clock enable
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

