luisfynn/sva/vrc1k/src/stm32f10x_system.c
	//Time base configuration
	//(100*72)/72000000 = 0.0001s
	TIM_TimeBaseStructure.TIM_Period = 100-1; 
	TIM_TimeBaseStructure.TIM_Prescaler = 72-1; 		
	TIM_TimeBaseStructure.TIM_ClockDivision = 0; 
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseStructure);

	//TIM2 enable counter
	TIM_Cmd(TIM2, ENABLE);	
	
	//TIM interrupt enable
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
}

void Timer_delay(WORD del)
{
	Ir_Timer_Count = 0;
	while(Ir_Timer_Count < del){
		printf("Timer2_counter : %d\r\n",Ir_Timer_Count);
	}
}

void IR_Receiver(void)
{
  	/* Set pin as input */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource13);

	/* Configure Key Button EXTI Line to generate an interrupt on falling edge */  
	EXTI_InitStructure.EXTI_Line = EXTI_Line13;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);
}

void Ir_Receive_code(void)
{
	//NEC Remocon 
	WORD count = Ir_Timer_Count ;
	//TIM2 enable counter
	TIM_Cmd(TIM2, DISABLE);

//	printf("ir_count %d\r\n",Ir_Timer_Count);
	TIM2->CNT = 0;
	Ir_Timer_Count  = 0;
	TIM_Cmd(TIM2, ENABLE);

	if(!LEADER_OK) 
	{
//		printf("count %d\r\n", count);
		if (count>=LEADER_MIN && count<=LEADER_MAX)			//first IR	
		{
			LEADER_OK		= 1;	// leader code ok flag
			chk_bit_cnt		= 4*8;	// remocon data bit number
			data_bit_cnt	= 8;	// data bit number
			data_cnt		= 0;
		}
	}else{
//		printf("count %d\r\n", count);
		if(count >= BIT_LO_MIN && count <= BIT_LO_MAX){		// low bit check
			remocon_temp >>= 1;		// shift right
			remocon_temp &= 0x7f;	// low data read
			data_end_check();
		}else if(count >= BIT_HI_MIN && count <= BIT_HI_MAX){	// high bit check
			remocon_temp >>= 1;		// shift right
			remocon_temp |= 0x80;	// high data read
			data_end_check();
		}else{						// data bit error
			LEADER_OK	= 0;		// leader code clear
		}
	}
}

void data_end_check(void)
{
	data_bit_cnt--;
	if(data_bit_cnt == 0)
	{
		remocon_data[data_cnt] = remocon_temp;
		data_bit_cnt = 8;
		data_cnt++;

		if(data_cnt == 4)
		{
			LEADER_OK	= 0;
		}
	}
}

void REMOCON_data_check(void)
{
	if(Old_IR_Key != remocon_data[2])
	{
		First_IR_Pressed = 1; 		//New IR key  
		printf("remocon data : %x\r\n", remocon_data[0]<<24 | remocon_data[1]<<16 | remocon_data[2] <<8 | remocon_data[3]);
		Old_IR_Key = remocon_data[2];

#if 1 
		switch(remocon_data[2])
		{
			case 0x36:
				remocon_trans_data[2] = 1;
				break;
			case 0x37:
				remocon_trans_data[2] = 2;
				break;
			case 0x41:
				remocon_trans_data[2] = 3;
				break;
			case 0x42:
				remocon_trans_data[2] = 4;
				break;
			case 0x43:
				remocon_trans_data[2] = 5;
				break;
			case 0x44:
				remocon_trans_data[2] = 6;
				break;
			case 0x45:
				remocon_trans_data[2] = 7;
				break;
			case 0x46:
				remocon_trans_data[2] = 8;
				break;
			case 0x47:
				remocon_trans_data[2] = 9;
				break;
			case 0x51:
				remocon_trans_data[2] = 0;
				break;
			default:
				break;
		}
		IR_Buffer[IR_Buffer_Count] = remocon_trans_data[2];
#endif	
		printf("IR_Buffer[%d] -- %d\r\n", IR_Buffer_Count, IR_Buffer[IR_Buffer_Count]);
		IR_Buffer_Count++;
		
		if(IR_Buffer_Count >20) 	IR_Buffer_Count = 0;
	}else if(First_IR_Pressed)
	{
		IR_Key_Pressed = 1; 		//New IR key confirmed 
		First_IR_Pressed = 0;
	}else{
	}

	if(IR_Key_Pressed)
	{
		if(remocon_data[0] != 0x68)	return;	// custom code 1 error
		if(remocon_data[1] != 0x72)	return;	// custom code 2 error
		if(remocon_data[2] != (remocon_data[3] ^ 0xff))	return;	// data error
	
		else
		{
			switch(remocon_data[2])
			{
				case 0x13:
					printf("remocon code ok\r\n");
					if(Repeat_IR_Key == 0){
						MDINOSD_EnableSprite(&stOSD[SPRITE_INDEX0], OFF);	// main-OSD display OFF 
						MDINOSD_EnableSprite(&stOSD[SPRITE_INDEX8], OFF);	// aux-OSD display OFF
						Repeat_IR_Key = 1;
					}else{
						MDINOSD_EnableSprite(&stOSD[SPRITE_INDEX0], ON);	// main-OSD display ON 
						MDINOSD_EnableSprite(&stOSD[SPRITE_INDEX8], ON);	// aux-OSD display ON
						Repeat_IR_Key = 0;
					}		
					remocon_data[2] = 0x0;
					Old_IR_Key = 0;
					
					IR_Buffer_Count = 0;
					IR_Key_Pressed = 0;
					break;
				
				case 0x05:
					TYEAR = 2000 + IR_Buffer[0]*10 + IR_Buffer[1];
					TMON =IR_Buffer[2]*10 + IR_Buffer[3];
					TDAY =IR_Buffer[4]*10 + IR_Buffer[5];
					
					BKP_WriteBackupRegister(BKP_DR2, TYEAR);
					BKP_WriteBackupRegister(BKP_DR3, TMON);
					BKP_WriteBackupRegister(BKP_DR4, TDAY);
				
					RTC_Hour =IR_Buffer[6]*10 + IR_Buffer[7];
					RTC_Min =IR_Buffer[8]*10 + IR_Buffer[9];
					RTC_Sec =IR_Buffer[10]*10 + IR_Buffer[11];
				
					RTC_Count = RTC_Hour*3600 + RTC_Min*60 + RTC_Sec;
						
					printf("RTC_Hour--->%d\r\n",RTC_Hour);
					printf("RTC_Min--->%d\r\n",RTC_Min);
					printf("RTC_Sec--->%d\r\n",RTC_Sec);
					printf("RTC_Count--->%d\r\n",RTC_Count);
						
					//RTC Reset	
					BKP_WriteBackupRegister(BKP_DR1, 0xffff);
					/* Wait until last write operation on RTC registers has finished */
  					RTC_WaitForLastTask();
 					/* Change the current time */
					RTC_SetCounter(RTC_Count);
 					/* Wait until last write operation on RTC registers has finished */
  					RTC_WaitForLastTask();
					BKP_WriteBackupRegister(BKP_DR1, 0xA5A5);

					CreateMDIN3xxGACFontInstance();
					
					Old_IR_Key = 0;
					remocon_data[2] = 0;
					IR_Buffer_Count = 0;
					IR_Key_Pressed = 0;
					break;
				default:
					remocon_data[2] = 0;
					Old_IR_Key = 0;
					IR_Key_Pressed = 0;
					break;
			}
		}
	}
}

void Video_Status_Check(void)
{
	if(Video_Change_Det_A != GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_8) ||Video_Change_Det_B != GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_9))
	{
		printf("Video setting change detection\r\n");
		MDINDLY_mSec(3000);	//3s

		if(System_Watchdog_En == 0){
			System_WatchDog();
			System_Watchdog_En = 1;
		}
	}
}

void System_WatchDog(void)
{
	/* WWDG configuration */
	/* Enable WWDG clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_WWDG, ENABLE);

