luisfynn/sva/vrc1k/src/stm32f10x_system.c
	/* WWDG clock counter = (PCLK1/4096)/8 = 244 Hz (~4 ms)  */
	WWDG_SetPrescaler(WWDG_Prescaler_8);

	/* Set Window value to 65 */
	WWDG_SetWindowValue(65);

	/* Enable WWDG and set counter value to 127, WWDG timeout = ~4 ms * 64 = 262 ms */
	WWDG_Enable(127);

	/* Clear EWI flag */
	WWDG_ClearFlag();

	/* Enable EW interrupt */
	WWDG_EnableIT();
}

void RTC_Configuration(void)
{
 	/* Enable PWR and BKP clocks */
 	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

 	/* Allow access to BKP Domain */
 	PWR_BackupAccessCmd(ENABLE);

 	/* Reset Backup Domain */
 	BKP_DeInit();

 	/* Enable LSE */
 	RCC_LSEConfig(RCC_LSE_ON);
 
 	/* Wait till LSE is ready */
 	while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
 	{}

 	/* Select LSE as RTC Clock Source */
 	RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

 	/* Enable RTC Clock */
 	RCC_RTCCLKCmd(ENABLE);

 	/* Wait for RTC registers synchronization */
 	RTC_WaitForSynchro();

 	/* Wait until last write operation on RTC registers has finished */
 	RTC_WaitForLastTask();

 	/* Enable the RTC Second */
 	RTC_ITConfig(RTC_IT_SEC, ENABLE);

 	/* Wait until last write operation on RTC registers has finished */
 	RTC_WaitForLastTask();

 	/* Set RTC prescaler: set RTC period to 1sec */
 	RTC_SetPrescaler(32767); /* RTC period = RTCCLK/RTC_PR = (32.768 KHz)/(32767+1) */

 	/* Wait until last write operation on RTC registers has finished */
 	RTC_WaitForLastTask();
}

void RTC_Time_Init(void)
{
  	if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5)
	{
	   /* Backup data register value is not correct or not yet programmed (when
		*        the first time the program is executed) */

		printf("RTC not yet configured....\r\n");

		/* RTC Configuration */
	    RTC_Configuration();

	    printf("RTC configured....\r\n");

	    /* Adjust time by values entred by the user on the hyperterminal */
	    Time_Adjust();
	
		BKP_WriteBackupRegister(BKP_DR1, 0xA5A5);
  	}
    else
  	{
      	/* Check if the Power On Reset flag is set */
	    if (RCC_GetFlagStatus(RCC_FLAG_PORRST) != RESET)
	    {
	        printf("Power On Reset occurred....\r\n");
		}
	  	/* Check if the Pin Reset flag is set */
	 	else if (RCC_GetFlagStatus(RCC_FLAG_PINRST) != RESET)
		{
		    printf("External Reset occurred....\r\n");
		}

		printf("No need to configure RTC....\r\n");
	    /* Wait for RTC registers synchronization */
	    RTC_WaitForSynchro();

	    /* Enable the RTC Second */
	    RTC_ITConfig(RTC_IT_SEC, ENABLE);
	    
		/* Wait until last write operation on RTC registers has finished */
	    RTC_WaitForLastTask();
	}
	
	/* Enable PWR and BKP clocks */
  	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

    /* Allow access to BKP Domain */
    PWR_BackupAccessCmd(ENABLE);

	/* Disable the Tamper Pin */
	BKP_TamperPinCmd(DISABLE); /* To output RTCCLK/64 on Tamper pin, the tamper
									                                 functionality must be disabled */
	/* Enable RTC Clock Output on Tamper Pin */
 	BKP_RTCOutputConfig(BKP_RTCOutputSource_CalibClock);
	
	/* Clear reset flags */
  	RCC_ClearFlag();

   	/* Display time */
   	Time_Show();
}

void Time_Adjust(void)
{
 	/* Wait until last write operation on RTC registers has finished */
  	RTC_WaitForLastTask();
 	/* Change the current time */
	RTC_SetCounter(Time_Regulate());
 	/* Wait until last write operation on RTC registers has finished */
  	RTC_WaitForLastTask();
}

WORD Time_Regulate(void)
{
#if 0
	WORD Hour = 0xff, Min = 0xff, Sec = 0xff;
	WORD Year = 0xff, Month = 0xff, Day = 0xff;

	printf("==============Time Setting============\r\n");
	printf("==============Type Year, MOnth, Day============\r\n");
	while(Year == 0xff && usart_receive_end ==1)
	{
		Year =(RxBuffer[0]<<12)|(RxBuffer[1]<<8)|(RxBuffer[2]<<4)|RxBuffer[3];
		printf("Year value is %d \r\n", Year);
	}
#endif
	return 50000;
}

BYTE Leap_Year(BYTE year)
{
	if(TYEAR % 400 == 0)		return TRUE; 		//leap year
	else if(TYEAR % 100 == 0)	return FALSE;		//not leap year
	else if(TYEAR % 4 == 0)		return TRUE;
	else						return FALSE;
}

void Time_Display(u32 TimeVar)
{	
	TYEAR = BKP_ReadBackupRegister(BKP_DR2);
	TMON = BKP_ReadBackupRegister(BKP_DR3);
	TDAY = BKP_ReadBackupRegister(BKP_DR4);

    /* Compute  hours */
    THH = TimeVar / 3600;
  	/* Compute minutes */
	TMM = (TimeVar % 3600) / 60;
    /* Compute seconds */
    TSS = (TimeVar % 3600) % 60;

	if(TSS > 59) TSS = TSS % 60;

	if(TMM > 59) TMM = TMM % 60;
	
	if(THH > 23) THH = THH % 24;
	
	if(TimeVar == 0)			//1 day = 86400s
	{
		TDAY ++;
		BKP_WriteBackupRegister(BKP_DR2, TYEAR);
		BKP_WriteBackupRegister(BKP_DR3, TMON);
		BKP_WriteBackupRegister(BKP_DR4, TDAY);
	}

	if(TMON == JANUARY || TMON == MARCH || TMON == MAY || TMON == JULY || TMON ==AUGUST || TMON == OCTOBER || TMON == DECEMBER) 
	{	
		if(TDAY >31)
		{
			TMON ++;
			TDAY = 1;
		}

		if(TMON >12)
		{
			TDAY = 1;
			TMON = 1;
			TYEAR ++;
		}
	}else if(TMON == APRIL || TMON == JUNE || TMON == SEPTEMBER || TMON == NOVEMBER)
	{
		if(TDAY >30)
		{
			TDAY = 1;
			TMON ++;
		}
	}else
	{
		if(TDAY == 29)
		{
			if(!Leap_Year(TYEAR))
			{
				TMON ++;
				TDAY =1;
			}else
			{
				if(TDAY == 30)
				{
					TMON ++;
					TDAY =1;
				}
			}
		}
	}
	printf("Time: %0.2d - %0.2d - %0.2d  %0.2d:%0.2d:%0.2d\r\n", TYEAR, TMON, TDAY, THH, TMM, TSS);
}

void Time_Show(void)
{
    /* If 1s has paased */
    if (TimeDisplay == 1)
    {
      	/* Display current time */
      	Time_Display(RTC_GetCounter());
   		TimeDisplay = 0;
	}
}

void Debug_main(void){
		
		if(usart_receive_end == 1){

			switch(RxBuffer[0])
			{
				WORD i, ID, data, temp_addr, temp_value;
				BYTE Data, Temp_addr, Temp_value;
				BYTE nData;
				DWORD RTC_Count;

				case 'd': 	
					printf("=====MDIN Host Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						MDINI2C_RegRead(0xc0, i, &data);
						
						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", data, (i%16==15)? "\r\n":" ");
					}
					
