luisfynn/sva/vrc1k/src/stm32f10x_system.c
					printf("=====MDIN Local Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x400;i++)
					{
						MDINI2C_RegRead(0xc2, i, &data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", data, (i%16==15)? "\r\n":" ");
					}
					
					printf("=====MDIN Hdmi Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x200;i++)
					{
						MDINI2C_RegRead(0xc4, i, &data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", data, (i%16==15)? "\r\n":" ");
					}

					usart_receive_end = 0;
					RxCounter = 0;
	   				USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
					break;
					
					usart_receive_end = 0;
					RxCounter = 0;
	   				USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
					break;

				////////////////////////////////////////////////////////////////////////////////////////////////////////
				////////////////////////////////////////////////////////////////////////////////////////////////////////
				
				case 't':
					printf("=====ADV7611 IO Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x98>>1, i, &Data);
						
						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}
					
					printf("=====ADV7611 CP Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x44>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}
					
					printf("=====ADV7611 HDMI Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x68>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}

					printf("=====ADV7611 KSV Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x64>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}

					printf("=====ADV7611 DPLL Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x30>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}

					printf("=====ADV7611 INFORFRAME Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x76>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}

					printf("=====ADV7611 EDID Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x6C>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}

					printf("=====ADV7611 CEC Register Dump start=====\r\n");	
					printf("       00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F\r\n");	
					printf("====================================================================================\r\n");	
					for(i=0;i<0x100;i++)
					{
						I2C1_ByteRead(0x80>>1, i, &Data);

						if(i%16==0) printf("%04x: ", i);
						printf("%04x%s", Data, (i%16==15)? "\r\n":" ");
					}

					usart_receive_end = 0;
					RxCounter = 0;
	   				USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
					break;


				case 'i':
					if((RxBuffer[1] =='c')&&(RxBuffer[11] =='w')){
						printf("MDIN I2C WRITE\r\n");

						switch(RxBuffer[2])
						{
							case '0':
								ID = 0xc0;
								break;
							case '1':
								ID = 0xc2;
								break;
							case '2':
								ID = 0xc4;
								break;
							default:
								ID = 0xc0;
								break;
						}
						printf("ID -->%x\r\n", ID);
						
						for(i=0;i<11;i++){
							if((RxBuffer[3+i]>='a')&&(RxBuffer[3+i]<='f')){
								RxBuffer[3+i] = RxBuffer[3+i] - 'W';
						//		printf("RxBuffer[3+%x]-->%x\r\n",i,RxBuffer[3+i]);
							}else{
								RxBuffer[3+i] = RxBuffer[3+i] - '0';
						//		printf("RxBuffer[3+%x]-->%x\r\n",i,RxBuffer[3+i]);
							}
						}

						temp_addr =(RxBuffer[3]<<12)|(RxBuffer[4]<<8)|(RxBuffer[5]<<4)|RxBuffer[6];
						temp_value =(RxBuffer[7]<<12)|(RxBuffer[8]<<8)|(RxBuffer[9]<<4)|RxBuffer[10];

						printf("temp_addr--->%x\r\n",temp_addr);
						printf("temp_value--->%x\r\n",temp_value);
						
						MDINI2C_RegWrite(ID, temp_addr, temp_value);
						MDINI2C_RegRead(ID, temp_addr, &temp_value);
						printf("read value --->%x\r\n",temp_value);

						RxBuffer[11] = '0';

					}else if((RxBuffer[1]=='c')&&(RxBuffer[7] =='r')){

