luisfynn/sva/vrc1k/src/stm32f10x_system.c
						printf("MDIN I2C READ\r\n");

						switch(RxBuffer[2])
						{
							case '0':
								ID = 0xc0;
								break;
							case '1':
								ID = 0xc2;
								break;
							case '2':
								ID = 0xc4;
								break;
							case '3':
								ID = 0xc6;
								break;
							default:
								ID = 0xc0;
								break;
						}
						printf("ID -->%x\r\n",ID);
				
						for(i=0;i<4;i++){
							if((RxBuffer[3+i]>='a')&&(RxBuffer[3+i]<='f')){
								RxBuffer[3+i] = RxBuffer[3+i] - 'W';
								//printf("RxBuffer[3+%x]-->%x\r\n",i,RxBuffer[3+i]);
							}else{
								RxBuffer[3+i] = RxBuffer[3+i] - '0';
							//	printf("RxBuffer[3+%x]-->%x\r\n",i,RxBuffer[3+i]);
							}
						}

						temp_addr =(RxBuffer[3]<<12)|(RxBuffer[4]<<8)|(RxBuffer[5]<<4)|RxBuffer[6];
						printf("temp_addr--->%x\r\n",temp_addr);
					
						MDINI2C_RegRead(ID, temp_addr, &temp_value);
						printf("read value --->%x\r\n",temp_value);
						RxBuffer[7] = '0';
					}else if((RxBuffer[0]=='i') &&(RxBuffer[1] != 'c')){
						RxBuffer[7] = '0';
						RxBuffer[11] = '0';
					}else{
						RxBuffer[7] = '0';
						RxBuffer[11] = '0';
					}
					usart_receive_end = 0;
					RxCounter = 0;
	   				USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
					break;

				case 'a':
					if((RxBuffer[1] =='c')&&(RxBuffer[7] =='w')){
						printf("I2C WRITE\r\n");

						switch(RxBuffer[2])
						{
							case '0':
								ID = 0x98;			//IO MAP
								break;
							case '1':
								ID = 0x80;			//CEC MAP
								break;
							case '2':
								ID = 0x7c;			//INFORFRAME
								break;
							case '3':
								ID = 0x4c;			//DPLL MAP
								break;
							case '4':
								ID = 0x64;			//KSV MAP
								break;
							case '5':
								ID = 0x6c;			//EDID
								break;
							case '6':
								ID = 0x68;			//HDMI MAP
								break;
							case '7':
								ID = 0x44;			//CP
								break;
							default:
								ID = 0x98;
								break;
						}
						printf("ID -->%x\r\n", ID);
						
						for(i=0;i<4;i++){
							if((RxBuffer[3+i]>='a')&&(RxBuffer[3+i]<='f')){
								RxBuffer[3+i] = RxBuffer[3+i] - 'W';
							}else{
								RxBuffer[3+i] = RxBuffer[3+i] - '0';
							}
						}

						Temp_addr =(RxBuffer[3]<<4)|(RxBuffer[4]);
						Temp_value =(RxBuffer[5]<<4)|(RxBuffer[6]);

						printf("Temp_addr--->%x\r\n",Temp_addr);
						printf("Temp_value--->%x\r\n",Temp_value);
						
						I2C1_ByteWrite(ID>>1, Temp_addr, Temp_value);  
						I2C1_ByteRead(ID>>1, Temp_addr , &Temp_value); 
						printf("read value --->%x\r\n",Temp_value);

						RxBuffer[7] = '0';

					}else if((RxBuffer[1]=='c')&&(RxBuffer[5] =='r')){

						printf("MDIN I2C READ\r\n");

						switch(RxBuffer[2])
						{
							case '0':
								ID = 0x98;			//IO MAP
								break;
							case '1':
								ID = 0x80;			//CEC MAP
								break;
							case '2':
								ID = 0x7c;			//INFORFRAME
								break;
							case '3':
								ID = 0x4c;			//DPLL MAP
								break;
							case '4':
								ID = 0x64;			//KSV MAP
								break;
							case '5':
								ID = 0x6c;			//EDID
								break;
							case '6':
								ID = 0x68;			//HDMI MAP
								break;
							case '7':
								ID = 0x44;			//CP
								break;
							default:
								ID = 0x98;
								break;
						}
						printf("ID -->%x\r\n",ID);
				
						for(i=0;i<2;i++){
							if((RxBuffer[3+i]>='a')&&(RxBuffer[3+i]<='f')){
								RxBuffer[3+i] = RxBuffer[3+i] - 'W';
							}else{
								RxBuffer[3+i] = RxBuffer[3+i] - '0';
							}
						}
						Temp_addr =(RxBuffer[3]<<4)|(RxBuffer[4]);
						printf("Temp_addr--->%x\r\n",Temp_addr);
						
						I2C1_ByteRead(ID>>1,Temp_addr, &Temp_value); 
						printf("read value --->%x\r\n",Temp_value);

						RxBuffer[5] = '0';
					}else if((RxBuffer[0]=='a') &&(RxBuffer[1] != 'c')){
						RxBuffer[5] = '0';
						RxBuffer[7] = '0';
					}else{
						RxBuffer[5] = '0';
						RxBuffer[7] = '0';
					}
					usart_receive_end = 0;
					RxCounter = 0;
	   				USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
					break;
				case 'h':
					if(message_load_ok == 0) debug_message();
					break;
				case 'r':
					if(RxBuffer[1] == 't' || RxBuffer[2] == 'c')
					{
						RTC_Year = ((RxBuffer[3] - 0x30) * 10) +( RxBuffer[4] -0x30);
						RTC_Mon = ((RxBuffer[5] - 0x30) * 10) +( RxBuffer[6] -0x30);
						RTC_Day = ((RxBuffer[7] - 0x30) * 10) +( RxBuffer[8] -0x30);

						RTC_Hour =((RxBuffer[9] - 0x30) * 10) +( RxBuffer[10] -0x30);
						RTC_Min =((RxBuffer[11] - 0x30) * 10) +( RxBuffer[12] -0x30);
						RTC_Sec =((RxBuffer[13] - 0x30) * 10) +( RxBuffer[14] -0x30);
						RTC_Count = RTC_Hour*3600 + RTC_Min*60 + RTC_Sec;
						
						//RTC Reset	
						BKP_WriteBackupRegister(BKP_DR1, 0xffff);
						/* Wait until last write operation on RTC registers has finished */
  						RTC_WaitForLastTask();
 						/* Change the current time */
						RTC_SetCounter(RTC_Count);
 						/* Wait until last write operation on RTC registers has finished */
  						RTC_WaitForLastTask();
						BKP_WriteBackupRegister(BKP_DR1, 0xA5A5);

						CreateMDIN3xxGACFontInstance();
					}	
				default:
					usart_receive_end = 0;
					RxCounter = 0;
					message_load_ok = 0;
	   				USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
					break;
			}
		}else{
	   		USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
		}

	#if 0 //MDIN-380 device ID Check
		WORD nID;
		nID = 0;
				
	//	MDINI2C_RegWrite(0xc0, 0x400, 0x02);       //select hdmi reg

		while(nID!=0x9736)
		{
			printf("\rMDIN Dev_ID check routine\n");
			MDINI2C_RegRead(0xc4, 0x0002, &nID);  
		}
		printf("\rMDIN Dev_ID check success\n");
	#endif
}

void debug_message(void)
{
	printf("======================= Debug option =================\r\n");	
	printf("d :  mdin register dump                               \r\n");	
	printf("t :  adv7611 register dump                            \r\n");	
	printf("                                                      \r\n");	
	printf("MDIN380 register access                               \r\n");	
	printf("usage: i2cx[addr(xxxxx)][data(xxxx)][r/w]             \r\n");	
	printf("    i2cx(host : x->0, local : x->1, hdmi : x->3)      \r\n");	
	printf("    addr & data : ex 0x300  -> 0300                   \r\n");	
	printf("    r/w -> read/write(if read, don't write data )     \r\n");	
	printf("                                                      \r\n");	
	printf("ADV7611 register access                               \r\n");	
	printf("usage: a2cx[addr(xxxxx)][data(xxxx)]                  \r\n");	
	printf("   a2cx(iomap : x->0, cec : x->1, inforframe : x->2)  \r\n");	
	printf("   a2cx(dpllmap : x->3, ksv: x->4, edid : x->5)       \r\n");	
	printf("   a2cx(hdmi : x->6, cp : x->7)                       \r\n");	
	printf("   addr & data : ex 0x300  -> 0300                    \r\n");	
	printf("   r/w -> read/write(if read, don't write data )      \r\n");	
	printf("============================================== =======\r\n");

	message_load_ok = 1;
}
